app/Http/Middleware/SetLocale.php

select * from `languages` where `is_active` = 1 and `language_code` = 'ar' limit 1
---

                // Get language
                $language = Cache::rememberForever('middleware_locale_' . $locale, function () use ($locale) {
                    return Language::where('is_active', true)->where('language_code', $locale)->first();