app/Livewire/Main/Cards/Bid.php

    public function mount($bid_id)
    {
        // Get bid
        $bid              = ProjectBid::whereUid($bid_id)
            ->whereStatus('active')
            ->with(['user.country', 'project.client'])
            ->firstOrFail();
---
select * from `project_bids` where `uid` = '18a7cd21cab63377ef3a' and `status` = 'active' limit 1
select * from `projects` where `projects`.`id` = 8 limit 1
select * from `users` where `users`.`id` = 1 and `users`.`deleted_at` is null limit 1