app/Livewire/Main/Explore/Projects/ProjectsComponent.php

    public function getProjectsProperty()
    {
        // Return projects
        return Project::query()
            ->whereIn('status', [ProjectStatus::Active, ProjectStatus::Completed])
            ->when($this->q, function ($query) {
                return $query->where(function ($query) {
                    return $query->where('title', 'LIKE', '%' . $this->q . '%')
                        ->orWhere('description', 'LIKE', '%' . $this->q . '%');
                });
            })
            ->when($this->cats, function ($query) {
                return $query->whereHas('category', function ($q) {
                    return $q->whereIn('slug', $this->cats);
                });
            })
            ->latest()
            ->cursorPaginate(15);
---
select * from `projects` where `status` in ('active', 'completed') and exists (select * from `categories` where `projects`.`category_id` = `categories`.`id` and `slug` in ('program')) order by `created_at` desc limit 16

    public function getCategoriesProperty()
    {
        return Cache::remember('explore_projects_categories', 60 * 60, function () {
            return ProjectCategory::latest()
                ->select('id', 'name', 'slug', 'thumbnail_id')
                ->with([
                    'thumbnail' => function ($query) {
                        return $query->select('id', 'uid', 'file_folder', 'file_extension');
                    },
                    'translation'
                ])
                ->get();
        });
---
select `id`, `name`, `slug`, `thumbnail_id` from `projects_categories` order by `created_at` desc