app/Livewire/Main/Seller/Projects/Milestones/MilestonesComponent.php

select * from `projects` where `uid` = 'CA7B85EC7A045546B8F3' and `awarded_freelancer_id` = 1 and `status` in ('active', 'completed', 'under_development', 'pending_final_review', 'incomplete', 'closed') and exists (select * from `project_bids` where `projects`.`awarded_bid_id` = `project_bids`.`id` and `user_id` = 1 and `is_freelancer_accepted` = 1 and `status` = 'active') limit 1
---
    public function mount($id)
    {
        // Get settings
        $settings = settings('projects');

        // Check if this section enabled
        if (!$settings->is_enabled) {

            // Redirect to home page
            return redirect('/');
        }

        // Get project
        $project = Project::where('uid', $id)
            ->where('awarded_freelancer_id', auth()->id())
            ->whereIn('status', ['active', 'completed', 'under_development', 'pending_final_review', 'incomplete', 'closed'])
            ->whereHas('awarded_bid', function ($query) {
                return $query->where('user_id', auth()->id())
                    ->where('is_freelancer_accepted', true)
                    ->where('status', 'active');
            })
            ->firstOrFail();

select count(*) as aggregate from `project_milestones` where `project_id` = 1
---
    public function getPaymentsProperty()
    {
        return ProjectMilestone::where('project_id', $this->project->id)
            ->latest()
            ->paginate(42);