app/Livewire/Main/Includes/Footer.php

select * from `pages` order by `id` asc
---
    public function getPagesProperty()
    {
        return Page::orderBy('id', 'asc')->get();