app/Livewire/Main/Includes/Header.php

select count(*) as aggregate from `ch_messages` where `to_id` = 6 and `seen` = 0
select * from `notifications` where `user_id` = 6 and `is_seen` = 0 order by `created_at` desc
select * from `languages` where `language_code` = 'ar' limit 1
---
    public function mount()
    {
        // Clean query
        $this->q = clean($this->q);

        // Check if user online
        if (auth()->check()) {

            // Count unread messages
            $unread_message      = Message::where('to_id', auth()->id())
                ->where('seen', false)
                ->count();

            // Set unread messages
            $this->new_messages  = $unread_message;

            // Get notifications
            $this->notifications = Notification::where('user_id', auth()->id())->where('is_seen', false)->latest()->get();
        }

        // Get language from session
        $locale   = session()->has('locale') ? session()->get('locale') : settings('general')->default_language;

        // Get default language
        $language = Language::where('language_code', $locale)->first();

select * from `languages` order by `name` asc
---
    public function getLanguagesProperty()
    {
        return Language::orderBy('name', 'asc')->get();