app/Livewire/Main/Includes/Header.php

    public function getLanguagesProperty()
    {
        return Language::orderBy('name', 'asc')->get();
---
select * from `languages` order by `name` asc