app/Livewire/Main/Home/HomeComponent.php

    public function getCategoriesProperty()
    {
        return Category::where('is_visible', true)->inRandomOrder()->get();
---
select * from `categories` where `is_visible` = 1 order by RAND()

    public function getProjectsProperty()
    {
        // Check if projects enabled
        if (settings('projects')->is_enabled) {

            // Get latest 12 projects
            return Project::whereIn('status', ['completed', 'active'])
                            ->where('is_featured', true)
                            ->take(12)
                            ->get();
---
select * from `projects` where `status` in ('completed', 'active') and `is_featured` = 1 limit 12