app/Utils/Chat/ChatApi.php

select * from `ch_messages` where `id` = 2693944215 limit 1
---
    public function fetchMessage($id, $index = null)
    {
        // Set empty variables
        $attachment           = null;
        $attachment_type      = null;
        $attachment_title     = null;
        $attachment_extension = null;
        $attachment_size      = null;

        // Fetch message
        $msg = Message::where('id', $id)->first();

insert into `ch_messages` (`id`, `from_id`, `to_id`, `body`, `attachment`, `updated_at`, `created_at`) values (2598733672, 5, '2', 'hello', null, '2025-07-18 08:46:17', '2025-07-18 08:46:17')
---
    public function newMessage($data)
    {
        $message             = new Message();
        $message->id         = $data['id'];
        // $message->type       = $data['type'];
        $message->from_id    = $data['from_id'];
        $message->to_id      = $data['to_id'];
        $message->body       = clean(strip_tags($data['body']));
        $message->attachment = $data['attachment'];
        $message->save();

update `ch_messages` set `seen` = 1, `ch_messages`.`updated_at` = '2025-07-17 22:14:05' where `from_id` = '0' and `to_id` = 2 and `seen` = 0
---
    public function makeSeen($user_id)
    {
        // Update messages
        Message::Where('from_id', $user_id)
                ->where('to_id', auth()->id())
                ->where('seen', false)
                ->update([ 'seen' => true ]);

select count(*) as aggregate from `ch_messages` where `from_id` = 3 and `to_id` = 2 and `seen` = 0
---
    public function countUnseenMessages($user_id)
    {
        return Message::where('from_id', $user_id)->where('to_id', auth()->id())->where('seen', 0)->count();

select count(*) as aggregate from `ch_favorites` where `user_id` = 2 and `favorite_id` = '3'
---
    public function inFavorite($user_id)
    {
        return Favorite::where('user_id', auth()->id())
                        ->where('favorite_id', $user_id)->count() > 0 ? true : false;