app/Livewire/Main/Account/Profile/ProfileComponent.php

    public function mount()
    {
        // Get user data
        $user               = auth()->user();

        // Get linked accounts
        $linked_accounts    = UserLinkedAccount::firstOrCreate(['user_id' => auth()->id()]);

        // Set user skills
        $this->skills       = auth()->user()->skills()->orderBy('id', 'desc')->get();

        // Set user languages
        $this->languages    = auth()->user()->languages()->orderBy('id', 'desc')->get();

        // Set user availability
        $this->availability = auth()->user()->availability()->first();
---
select * from `user_linked_accounts` where (`user_id` = 2) limit 1
select * from `user_skills` where `user_skills`.`user_id` = 2 and `user_skills`.`user_id` is not null order by `id` desc
select * from `user_languages` where `user_languages`.`user_id` = 2 and `user_languages`.`user_id` is not null order by `id` desc
select * from `user_availability` where `user_availability`.`user_id` = 2 and `user_availability`.`user_id` is not null limit 1