app/Livewire/Main/Project/ProjectComponent.php

    public function mount($pid, $slug)
    {
        // Get projects settings
        $settings = settings('projects');

        // Check if this section enabled
        if (!$settings->is_enabled) {
            return redirect('/');
        }

        // Get project
        $project = Project::where('pid', $pid)
            ->where('slug', $slug)
            ->with(['client.country', 'client.billing'])
            ->withCount(['bids' => function ($query) {
                return $query->where('status', 'active');
            }])
            ->firstOrFail();
---
select * from `countries` where `countries`.`id` in (105)

    public function getPlansProperty()
    {
        // Check if promoting bids allowed
        if (settings('projects')->is_premium_bidding) {

            // Don't get sponsored plan, if already has a sponsored bid
            // Because only one sponsored bid is allowed
            if ($this->hasSponsoredBid()) {

                // Get plans without sponsored
                return ProjectBiddingPlan::whereIsActive(true)->where('plan_type', '!=', 'sponsored')->get();
            }

            // Return all plans, no sponsored bid yet
            return ProjectBiddingPlan::whereIsActive(true)->get();
---
select * from `projects_bidding_plans` where `is_active` = 1

    public function getBidsProperty()
    {
        // Check if has a sort by
        if (in_array($this->sort_bids_by, ['newest', 'oldest', 'fastest', 'cheapest'])) {

            // Check sort by
            switch ($this->sort_bids_by) {

                // Newest
                case 'newest':
                    return ProjectBid::whereProjectId($this->project->id)
                        ->whereIsSponsored(false)
                        ->whereStatus('active')
                        ->latest()
                        ->get();
                    break;

                // Oldest
                case 'oldest':
                    return ProjectBid::whereProjectId($this->project->id)
                        ->whereIsSponsored(false)
                        ->whereStatus('active')
                        ->oldest()
                        ->get();
---
select * from `project_bids` where `project_id` = 8 and `is_sponsored` = 0 and `status` = 'active'

        }

        // No sort by
        return ProjectBid::whereProjectId($this->project->id)->whereIsSponsored(false)->whereStatus('active')->get();
---
select * from `project_bids` where `project_id` = 1 and `is_sponsored` = 0 and `status` = 'active'

    public function getBestBidsProperty(): Collection
    {
        $bids = $this->project->bids()
            ->where('status', 'active')
            ->with('user')
            ->get();
---
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null

    protected function prepareClientInsights(): array
    {
        $client = $this->project?->client;

        if (!$client) {
            return [
                'has_payment_method' => false,
                'last_activity'      => null,
                'projects_count'     => 0,
                'orders_count'       => 0,
            ];
        }

        $hasPaymentMethod = $client->relationLoaded('billing')
            ? (bool) $client->billing
            : $client->billing()->exists();

        $projectsCount = Project::where('user_id', $client->id)->count();
---
select count(*) as aggregate from `projects` where `user_id` = 6

            }

            // After that we have to check if this user already submitted a bid to this project
            if (ProjectBid::whereProjectId($this->project->id)->whereUserId(auth()->id())->first()) {
---
select * from `project_bids` where `project_id` = 2 and `user_id` = 1 limit 1

    private function hasSponsoredBid()
    {
        // Get any sponsored active bid
        $bid = ProjectBid::whereProjectId($this->project->id)->whereIsSponsored(true)->whereStatus('active')->first();
---
select * from `project_bids` where `project_id` = 1 and `is_sponsored` = 1 and `status` = 'active' limit 1

    private function checkIfAlreadySubmittedBid()
    {
        try {

            // Check if user online
            if (auth()->check()) {

                // Get proposal
                $proposal                         = ProjectBid::where('project_id', $this->project->id)
                    ->where('user_id', auth()->id())
                    ->first();
---
select * from `project_bids` where `project_id` = 1 and `user_id` = 1 limit 1

    private function monthlyProposalUsage(): array
    {
        try {

            $limit = (int) (settings('general')->free_plan_monthly_proposals ?? 0);

            if (!auth()->check()) {
                return ['used' => 0, 'limit' => $limit];
            }

            if ($limit <= 0) {
                return ['used' => 0, 'limit' => 0];
            }

            $used = ProjectBid::where('user_id', auth()->id())
                ->whereBetween('created_at', [
                    Carbon::now()->startOfMonth(),
                    Carbon::now()->endOfMonth(),
                ])
                ->count();
---
select count(*) as aggregate from `project_bids` where `user_id` = 1 and `created_at` between '2025-10-01 00:00:00' and '2025-10-31 23:59:59'