app/Livewire/Main/Account/Projects/ProjectsComponent.php

select count(*) as aggregate from `projects` where `user_id` = 6
---
    public function getProjectsProperty()
    {
        return Project::where('user_id', auth()->id())
            ->withCount('bids')
            ->with(['subscriptions' => function ($query) {
                return $query->where('status', 'pending')->latest()->first();
            }])
            ->latest()
            ->paginate(42);