app/Utils/Helper/helpers.php

select * from `settings_general` limit 1
---

                // Return data
                return Cache::rememberForever('settings_general', function () {
                    return SettingsGeneral::first();

select count(*) as aggregate from `ch_messages` where `to_id` = 2 and `seen` = 0
---
function unseen_messages_count(): mixed
{
    try {

        $unseen = 0;
        if (auth()->check()) {
            $unseen = \App\Models\ChMessage::where('to_id', auth()->id())
                                                ->where('seen', false)
                                                ->count();