app/Utils/Helper/helpers.php

function settings($settings, $updateCache = false)
{
    // Check what settings you want
    switch ($settings) {

        case 'currency':

            // Check if want to update cache
            if ($updateCache) {

                // Remove it from cache
                Cache::forget('settings_currency');
            } else {

                // Return data
                return Cache::rememberForever('settings_currency', function () {
                    return SettingsCurrency::first();
---
select * from `settings_currency` limit 1


                // Return data
                return Cache::rememberForever('settings_publish', function () {
                    return SettingsPublish::first();
---
select * from `settings_publish` limit 1


                // Return data
                return Cache::rememberForever('settings_general', function () {
                    return SettingsGeneral::first();
---
select * from `settings_general` limit 1


                // Return data
                return Cache::rememberForever('settings_seo', function () {
                    return SettingsSeo::with('ogimage')->first();
---
select * from `settings_seo` limit 1


                // Return data
                return Cache::rememberForever('settings_appearance', function () {
                    return SettingsAppearance::with('placeholder')->first();
---
select * from `settings_appearance` limit 1

function advertisements($name = null, $updateCache = false)
{
    // Check if want to update cache
    if ($updateCache) {

        // Clear old cache
        Cache::forget('advertisements');

        // Save ads
        Cache::rememberForever('advertisements', function () {
            return Advertisement::first();
        });
    } else {

        // Get ads
        $ads = Cache::rememberForever('advertisements', function () {
            return Advertisement::first();
---
select * from `advertisements` limit 1

function payment_gateway($slug, $update = false, $is_offline = false)
{
    try {

        // Check if want to update cache
        if ($update) {

            // Check if offline payment gateway
            if ($is_offline) {

                // Remove it from cache
                Cache::forget('offline_payment_gateway_settings_' . $slug);
            } else {

                // Remove it from cache
                Cache::forget('automatic_payment_gateway_settings_' . $slug);
            }
        } else {

            // Check if offline payment gateway
            if ($is_offline) {

                // Return data
                return Cache::rememberForever('offline_payment_gateway_settings_' . $slug, function () use ($slug) {

                    // Get the payment gateway
                    $gateway = OfflinePaymentGateway::where('slug', $slug)->with('logo')->first();
---
select * from `offline_payment_gateways` where `slug` = 'offline' limit 1

            return Cache::rememberForever('automatic_payment_gateway_settings_' . $slug, function () use ($slug) {

                // Get the payment gateway
                $gateway = AutomaticPaymentGateway::where('slug', $slug)->with('logo')->first();
---
select * from `automatic_payment_gateways` where `slug` = 'paypal' limit 1

function unseen_messages_count(): mixed
{
    try {

        $unseen = 0;
        if (auth()->check()) {
            $unseen = \App\Models\ChMessage::where('to_id', auth()->id())
                ->where('seen', false)
                ->count();
---
select count(*) as aggregate from `ch_messages` where `to_id` = 1 and `seen` = 0