app/Http/Controllers/Chat/MessagesController.php

select * from `users` where `id` != 2 and `uid` = 'B90FBD14C4E3BC2A001A' and `status` in ('active', 'verified') and `users`.`deleted_at` is null limit 1
---
    public function index( $id = null)
    {
        // Get user
        $user        = User::where('id', '!=', auth()->id())
                            ->where('uid', $id)
                            ->whereIn('status', ['active', 'verified'])
                            ->first();

select `id`, `uid`, `username`, `fullname`, `avatar_id`, `active_status` from `users` where `id` = '3' and `users`.`deleted_at` is null limit 1
---
    public function idFetchData(Request $request)
    {
        // Check if user in favorite list
        $favorite = $this->chat->inFavorite($request->get('id'));

        // User data
        if ($request->get('type') == 'user') {

            // Get user
            $fetch = User::where('id', $request->get('id'))
                            ->select('id', 'uid', 'username', 'fullname', 'avatar_id', 'active_status')
                            ->with('avatar', function($query) {
                                return $query->select('id', 'file_extension', 'file_folder', 'uid');
                            })
                            ->first();

select * from `users` where `id` = '2' and `users`.`deleted_at` is null limit 1
---
            // If user if offline send him a message via email
            // We have to send a notification every 10 minutes
            // To prevent sending a notification on every message
            Cache::get($notification_cache_value, function () use ($request, $notification_cache_value) {

                if (auth()->id() != $request->get('id')) {

                    // Get user data
                    $user = User::where('id', $request->get('id'))->first();

                    // Check if user offline
                    if ($user->active_status != 1 || !$user->isOnline()) {

                        $user->notify(new NewMessage( $user->uid ));

                    }

                }

                // Save cache value
                return Cache::put($notification_cache_value, 'sent', 600);

            });

select `users`.*, MAX(ch_messages.created_at) max_created_at from `ch_messages` inner join `users` on `ch_messages`.`from_id` = `users`.`id` or `ch_messages`.`to_id` = `users`.`id` where (`ch_messages`.`from_id` = 5 or `ch_messages`.`to_id` = 5) and `users`.`id` != 5 group by `users`.`id` order by `max_created_at` desc limit 30 offset 0
---
    public function getContacts(Request $request)
    {
        // Get users
        $users = Message::join('users',  function ($join) {
                            $join->on('ch_messages.from_id', '=', 'users.id')
                                ->orOn('ch_messages.to_id', '=', 'users.id');
                        })
                        ->where(function ($q) {
                            $q->where('ch_messages.from_id', auth()->id())
                            ->orWhere('ch_messages.to_id', auth()->id());
                        })
                        ->with('avatar')
                        ->where('users.id','!=',auth()->id())
                        ->select('users.*',DB::raw('MAX(ch_messages.created_at) max_created_at'))
                        ->orderBy('max_created_at', 'desc')
                        ->groupBy('users.id')
                        ->paginate($request->per_page ?? $this->perPage);

select * from `users` where `id` = '2' and `users`.`deleted_at` is null limit 1
---
    public function updateContactItem(Request $request)
    {
        // Get user data
        $user = User::where('id', $request->get('user_id'))->first();

select * from `ch_favorites` where `user_id` = 2
select count(*) as aggregate from `ch_favorites` where `user_id` = 2
---
    public function getFavorites(Request $request)
    {
        // Set favorite list variable
        $favoritesList = null;

        // Get chats in favorite
        $favorites     = Favorite::where('user_id', auth()->id());

        // Loop through favorites
        foreach ($favorites->get() as $favorite) {

            // Get user data
            $user           = User::where('id', $favorite->favorite_id)->first();

            // Check if user exist
            if ($user) {

                // Set view
                $favoritesList .= view('Chatify::layouts.favorite', [
                    'user' => $user,
                ]);

            }

        }

        // Send the response
        return Response::json([
            'count'     => $favorites->count(),
            'favorites' => $favorites->count() > 0 ? $favoritesList : 0
        ], 200);

update `users` set `active_status` = 0, `users`.`updated_at` = '2025-07-26 16:52:50' where `id` = '2' and `users`.`deleted_at` is null
---
    public function setActiveStatus(Request $request)
    {
        // Get user id
        $userId       = $request->get('user_id');

        // Get status
        $activeStatus = $request->get('status') > 0 ? 1 : 0;

        // Set status
        $status       = User::where('id', $userId)->update(['active_status' => $activeStatus]);