app/Livewire/Main/Auth/RegisterComponent.php

select * from `levels` where `account_type` = 'buyer' order by `id` asc limit 1
insert into `users` (`uid`, `fullname`, `email`, `username`, `password`, `status`, `account_type`, `level_id`, `updated_at`, `created_at`) values ('5F80CF7160CA74B44C50', 'Ahmed', 'ahmed@gmail.com', 'ahmed', '$2y$10$NDexMylWYpi.gZ7z5IbapOdS9E59U3dJLgxWIrH1khSH1jkYSua1.', 'active', 'buyer', 1, '2025-10-25 08:34:12', '2025-10-25 08:34:12')
---
            $user->account_type = $this->account_type;

            // Assign default level based on account type
            $default_level = Level::where('account_type', $this->account_type)->oldest('id')->first();
            $user->level_id = $default_level ? $default_level->id : 1;
            $user->save();