app/Livewire/Main/Account/Projects/Options/CheckoutComponent.php

select * from `project_subscriptions` where `uid` = 'b8ad9126-886c-446e-9806-09f4f05de1c9' and `status` = 'pending' and exists (select * from `projects` where `project_subscriptions`.`project_id` = `projects`.`id` and `user_id` = 1 and `status` = 'pending_payment') limit 1
---
    public function mount($id)
    {
        // Get subscription
        $subscription       = ProjectSubscription::where('uid', $id)
                                                    ->where('status', 'pending')
                                                    ->whereHas('project', function($query) {
                                                        return $query->where('user_id', auth()->id())
                                                                    ->where('status', 'pending_payment');
                                                    })
                                                    ->firstOrFail();

select * from `automatic_payment_gateways` where `is_active` = 1 order by `name` asc
---
    public function getPaymentMethodsProperty()
    {
        return AutomaticPaymentGateway::where('is_active', true)
                                        ->oldest('name')
                                        ->get();