app/Livewire/Main/Account/Projects/Options/MilestonesComponent.php

    public function mount($id)
    {
        // Get project
        $project                    = Project::where('uid', $id)
            ->whereHas('awarded_bid', function ($query) {
                return $query->where('is_freelancer_accepted', true);
            })
            ->where('user_id', auth()->id())
            ->with('awarded_bid')
            ->firstOrFail();
---
select * from `projects` where `uid` = 'CA7B85EC7A045546B8F3' and exists (select * from `project_bids` where `projects`.`awarded_bid_id` = `project_bids`.`id` and `is_freelancer_accepted` = 1) and `user_id` = 6 limit 1

    public function getPaymentsProperty()
    {
        return ProjectMilestone::where('project_id', $this->project->id)
            ->latest()
            ->paginate(42);
---
select * from `project_milestones` where `project_id` = 1 order by `created_at` desc limit 42 offset 0
select count(*) as aggregate from `project_milestones` where `project_id` = 1

    public function details($id)
    {
        try {
            $payment = ProjectMilestone::where('project_id', $this->project->id)
                ->where('uid', $id)
                ->firstOrFail();
---
select * from `project_milestones` where `project_id` = 1 and `uid` = 'A4A48F1EF957AACF368B' limit 1

    public function confirmPay($id)
    {
        try {

            // Get milestone payment
            $payment = ProjectMilestone::where('project_id', $this->project->id)
                ->where('status', 'request')
                ->where('uid', $id)
                ->firstOrFail();
---
select * from `project_milestones` where `project_id` = 1 and `status` = 'request' and `uid` = 'A4A48F1EF957AACF368B' limit 1