app/Livewire/Main/Partials/Languages.php

    public function mount()
    {
        // Get language from session
        $locale   = session()->has('locale') ? session()->get('locale') : settings('general')->default_language;

        // Get default language
        $language = Language::where('language_code', $locale)->first();
---
select * from `languages` where `language_code` = 'ar' limit 1