app/Livewire/Main/Partials/Notifications.php

select * from `notifications` where `user_id` = 1 and `is_seen` = 0 order by `created_at` desc
---
    public function mount()
    {
        // Get notifications
        $notifications       = Notification::where('user_id', auth()->id())->where('is_seen', false)->latest()->get();